* Sprint 1
|                                           | Note | Hatim | Alikhan              | Matthew | Armsky | Commentaires |
| Qualité du prototype d'interface :        | A    |       |                      |         |        |              |
|                                           |      |       |                      |         |        |              |
| Présentation :                            | A    |       |                      |         |        |              |
|                                           |      |       |                      |         |        |              |
| Évaluation du travail par les pairs (50%) | ×    | A     | E - Pas d'évaluation | A       | A      |              |
| Participation à la présentation     (50%) | ×    | A     | A                    | A       | A      |              |
|-------------------------------------------+------+-------+----------------------+---------+--------+--------------|
| Total                                     |      | 10    | 5                    | 10      | 10     |              |

* Sprint 2
|                                           | Note | Alikhan | Matthew           | Hatim | Armsky                        | Commentaires                         |
| Qualité du produit :                      | B    |         |                   |       |                               | Quelques fonctionnalités prototypées |
|                                           |      |         |                   |       |                               |                                      |
| Présentation :                            | A    |         |                   |       |                               |                                      |
|                                           |      |         |                   |       |                               |                                      |
| Évaluation du travail par les pairs (33%) | ×    | A       | A                 | A     | E - Pas d'évaluation d'équipe |                                      |
| Participation à la présentation     (33%) | ×    | A       | A                 | A     | A                             |                                      |
| Participation au développement      (33%) | ×    | A       | E  - aucun commit | A     | E - aucun commit.             |                                      |
|-------------------------------------------+------+---------+-------------------+-------+-------------------------------+--------------------------------------|
| Total                                     |      | 9       | 6.7               | 9     | 3                             |                                      |

* Sprint 3
|                                           | Note | Hatim                       | Armsky               | Alikhan | Matthew           | Commentaires                                              |
| Qualité du produit :                      | A    |                             |                      |         |                   |                                                           |
|                                           |      |                             |                      |         |                   |                                                           |
| Présentation :                            | C    |                             |                      |         |                   | Le code n'est pas fusionné en une seule app fonctionnelle |
|                                           |      |                             |                      |         |                   |                                                           |
| Évaluation du travail par les pairs (33%) | ×    | E - pas d'évaluation        | E - pas d'évaluation | A       | B                 |                                                           |
| Participation à la présentation     (33%) | ×    | A                           | A                    | A       | A                 |                                                           |
| Participation au développement      (33%) | ×    | D - 2 commits non fusionnés | E - Aucun commit     | A       | D - 1 seul commit |                                                           |
|-------------------------------------------+------+-----------------------------+----------------------+---------+-------------------+-----------------------------------------------------------|
| Total                                     |      | 3.7                         | 2.7                  | 8       | 5.9               |                                                           |

* Sprint 4
|                                           | Note                | Hatim                | Alikhan | Armsky | Matthew           | Commentaires |
| Qualité du produit :                      | A                   |                      |         |        |                   |              |
|                                           |                     |                      |         |        |                   |              |
| Présentation :                            | C - Non fonctionnel |                      |         |        |                   |              |
|                                           |                     |                      |         |        |                   |              |
| Évaluation du travail par les pairs (33%) | ×                   | E - pas d'évaluation | A       | A      | C                 |              |
| Participation à la présentation     (33%) | ×                   | A                    | A       | A      | A                 |              |
| Participation au développement      (33%) | ×                   | A                    | A       | A      | E - pas de commit |              |
|-------------------------------------------+---------------------+----------------------+---------+--------+-------------------+--------------|
| Total                                     | 8                   | 5.3                  | 8       | 8      | 4.3               |              |

* Livraison finale
|                                                                                                                    |             |            |      |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                   Alikhan |                     Hatim | Matthew                               | Armsky                          |
|                                                                                                                    | Pondération | Évaluation | Note | Commentaires                                                                                                                                                                                                                                                                                                                                                                                                                                        | Participation personnelle | Participation personnelle | Participation personnelle             | Participation personnelle       |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------------------+---------------------------------|
| Programmation correcte des fonctionnalités de l’application                                                        |             |            |      |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                           |                           |                                       |                                 |
| - Séparation des responsabilités                                                                                   |          15 | C          |  9.0 | La classe BaseDeDonnées n'a rien à faire dans les entitées. Les «PrésentateurGestionnaire» sont une mauvaise idée; vous avez essentiellement remélangé les rôles de la vue et du présentateur après les avoir séparés. Par exemple, la méthode GestionIPA.afficherStationnementsRayon fait le travail du présentateur (gérer les fils d'exécution) et celui de la vue (ajouter une marque dans l'IU). Le PrésentateurFavoris fait des tâches de IU. |                           |                           |                                       |                                 |
| - Dépendances unidirectionnelles                                                                                   |          10 | A          | 10.0 |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                           |                           |                                       |                                 |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------------------+---------------------------------|
| Conception correcte des interfaces graphiques                                                                      |             |            |      |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                           |                           |                                       |                                 |
| - Respecte les principes d'ergonomie                                                                               |          10 | B          |  8.0 |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                           |                           |                                       |                                 |
| - Internationalisation                                                                                             |           5 | C          |  3.0 | Partiel                                                                                                                                                                                                                                                                                                                                                                                                                                             |                           |                           |                                       |                                 |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------------------+---------------------------------|
| Programmation judicieuse des interactions avec l’utilisateur                                                       |             |            |      |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                           |                           |                                       |                                 |
| - Robustesse                                                                                                       |           5 | A          |  5.0 |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                           |                           |                                       |                                 |
| - Utilisation de fils d'exécution                                                                                  |          10 | C          |  6.0 | Pas de fil d'exécution pour la BD. Dans GestionIPA vous faites des requêtes dans Main (ajouterStationnementFavoris) et des actions IU dans IO (recupérerTousStationnements).                                                                                                                                                                                                                                                                        |                           |                           |                                       |                                 |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------------------+---------------------------------|
| Programmation judicieuse des interactions avec l’environnement (capteurs, logiciels, données internes et externes) |             |            |      |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                           |                           |                                       |                                 |
| - Passage de données à une application tierce                                                                      |           5 | A          |  5.0 |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                           |                           |                                       |                                 |
| - Gestion des cas d'erreur                                                                                         |           5 | E          |  0.0 | Je n'en ai pas trouvé                                                                                                                                                                                                                                                                                                                                                                                                                               |                           |                           |                                       |                                 |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------------------+---------------------------------|
| Utilisation adéquate des mécanismes de collaboration en équipe                                                     |             |            |      |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                           |                           |                                       |                                 |
| - Utilisation de branches et commits                                                                               |           5 | A          |  5.0 |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                           |                           |                                       |                                 |
| - Documentation des commits                                                                                        |           5 | A          |  5.0 |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                           |                           |                                       |                                 |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------------------+---------------------------------|
| Pertinence et clarté de la documentation                                                                           |             |            |      |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                           |                           |                                       |                                 |
| - Clarté du code                                                                                                   |           5 | C          |  3.0 | Très difficile à lire. Vos commentaires sont inconstants et documentent surtout ce qui est déjà évident.                                                                                                                                                                                                                                                                                                                                            |                           |                           |                                       |                                 |
| - Nomenclature (fonctions, variables, classes)                                                                     |           5 | A          |  5.0 |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                           |                           |                                       |                                 |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------------------+---------------------------------|
| Validation judicieuse de l’application à l’aide de tests                                                           |             |            |      |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                           |                           |                                       |                                 |
| - Tests unitaires du domaine (entités, services)                                                                   |          10 | C          |  6.0 | Vos tests ne couvrent pas tout, mais vous êtes assez bien partis.                                                                                                                                                                                                                                                                                                                                                                                   |                           |                           |                                       |                                 |
| - Tests unitaires de la couche présentation (présentateurs)                                                        |           5 | C          |  3.0 | Vous moquez des choses qui n'ont pas à l'être (PointAnnotation) et vous ne moquez pas ce qui devrait l'être (La source de ObtenirRessourceService)                                                                                                                                                                                                                                                                                                  |                           |                           |                                       |                                 |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------------------+---------------------------------|
| Qualité du français                                                                                                |  (max -10%) | A          | -0.0 |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                           |                           |                                       |                                 |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------------------+---------------------------------|
| Sous-Total                                                                                                         |             |            |  73. |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                           |                           |                                       |                                 |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------------------+---------------------------------|
| Participation personnelle                                                                                          |        100% |            |    × |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                       100 |                       100 | 40 - aucun commit fusionné dans main. | 60 - pas de commit avant 1 déc. |
|--------------------------------------------------------------------------------------------------------------------+-------------+------------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------+---------------------------+---------------------------------------+---------------------------------|
| Total                                                                                                              |             |            |      |                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                      73.0 |                      73.0 | 29.0                                  | 43.8                            |
#+TBLFM: @3$4..@23$4='(if (string= "" $2) "" (format "%2.1f" (* (string-to-number $2) (if (string= $3 "E") 0 (/ (+ (- 70 (aref $3 0)) (cond ((= (aref (substring $3 -1) 0) ?+) 0.33) ((= (aref (substring $3 -1) 0) ?-) -0.33) (t 0))) 5.0)))))'::@24$4='(format "-%2.1f" (+ 10 (* -10 (/ (+ (- 70 (aref $3 0)) (cond ((= (aref (substring $3 -1) 0) ?+) 0.33) ((= (aref (substring $3 -1) 0) ?-) -0.33) (t 0))) 5.0))))'::@25$4=vsum(@3..@24)::@27$6='(format "%2.1f" (/ (* (string-to-number @25$4) (string-to-number @26$6)) 100))'::@27$7='(format "%2.1f" (/ (* (string-to-number @25$4) (string-to-number @26$7)) 100))'::@27$8='(format "%2.1f" (/ (* (string-to-number @25$4) (string-to-number @26$8)) 100))'::

